Core/src/src/Reports/ДвиженияДокумента/ДвиженияДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДвиженияДокумента</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.СписаниеЗапасов</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ПередачаВА</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ОдноразовыеНачисления</types>
      <types>DocumentRef.ПереоценкаВРозницеСуммовойУчет</types>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.СчетФактураПолученныйГрузия</types>
      <types>DocumentRef.КомплектацияВА</types>
      <types>DocumentRef.РасходныйОрдер</types>
      <types>DocumentRef.РасспределениеЗатратНаТовары</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.ЗакупкаЛицензий</types>
      <types>DocumentRef.ЧекККМВозврат</types>
      <types>DocumentRef.АмортизацияВА</types>
      <types>DocumentRef.ПланПродаж</types>
      <types>DocumentRef.ЗаданиеНаРаботу</types>
      <types>DocumentRef.ВыработкаВА</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.НачислениеНалогов</types>
      <types>DocumentRef.ОтпускаСотрудников</types>
      <types>DocumentRef.ТаможенноеОформление</types>
      <types>DocumentRef.КомПредложение</types>
      <types>DocumentRef.СписаниеТопливаЗапасов</types>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ПринятиеКУчетуВА</types>
      <types>DocumentRef.ПрочиеРасходы</types>
      <types>DocumentRef.РезервированиеЗапасов</types>
      <types>DocumentRef.СчетФактура</types>
      <types>DocumentRef.ПеремещениеДСПлан</types>
      <types>DocumentRef.ПоступлениеДСПлан</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ИзменениеПараметровВА</types>
      <types>DocumentRef.ПеремещениеВА</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПродажаЛицензии</types>
      <types>DocumentRef.Конвертация</types>
      <types>DocumentRef.НачисленияПоКредитамИЗаймам</types>
      <types>DocumentRef.НевыходыНаРаботуСотрудников</types>
      <types>DocumentRef.СборкаЗапасов</types>
      <types>DocumentRef.ПеремещениеПоЯчейкам</types>
      <types>DocumentRef.ВозвратДенегОтПФ</types>
      <types>DocumentRef.СчетНаОплату</types>
      <types>DocumentRef.РаспределениеЗатрат</types>
      <types>DocumentRef.УчетВремени</types>
      <types>DocumentRef.НачислениеЗарплаты</types>
      <types>DocumentRef.Увольнение</types>
      <types>DocumentRef.ПриемНаРаботу</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПересортицаЗапасов</types>
      <types>DocumentRef.СписаниеБалловЛояльности</types>
      <types>DocumentRef.РасходДСПлан</types>
      <types>DocumentRef.ПеремещениеДС</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.Операция</types>
      <types>DocumentRef.Табель</types>
      <types>DocumentRef.РасходИзКассы</types>
      <types>DocumentRef.ДругиеВидыОтсутствия</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Импорт</types>
      <types>DocumentRef.Взаимозачет</types>
      <types>DocumentRef.ЗакрытиеМесяца</types>
      <types>DocumentRef.СписаниеВАНаТовары</types>
      <types>DocumentRef.СчетФактураОтправленныйГрузия</types>
      <types>DocumentRef.НачислениеНалоговыхЛгот</types>
      <types>DocumentRef.РасходыПриИмпорте</types>
      <types>DocumentRef.ВнутреннийЗаказ</types>
      <types>DocumentRef.ПриходныйОрдер</types>
      <types>DocumentRef.Бюджет</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.ВводНачальныхОстатков</types>
      <types>DocumentRef.LT_СоответствияДанныхDMS</types>
      <types>DocumentRef.СписаниеВА</types>
      <types>DocumentRef.МинимальныеОстаткиСклада</types>
      <types>DocumentRef.СдельныйНаряд</types>
      <types>DocumentRef.УстановкаСкидок</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ДополнительныеРасходы</types>
      <types>DocumentRef.ДоговорКредитаИЗайма</types>
      <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      <types>DocumentRef.ОприходованиеЗапасов</types>
      <types>DocumentRef.КадровоеПеремещение</types>
      <types>DocumentRef.УчетРабочегоВремениСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыводаОтчета</name>
    <type>
      <types>EnumRef.СпособВыводаОтчета</types>
    </type>
  </attributes>
</mdclass:Report>

Core/src/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>СценарийПланирования</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Core/src/src/AccountingRegisters/ХозрасчетныйПлан/ХозрасчетныйПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>ХозрасчетныйПлан</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>СценарийПланирования</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Core/src/src/Enums/СпособВыводаОтчета/СпособВыводаОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособВыводаОтчета</name>
  <comment>Способ вывода отчета</comment>
  <enumValues>
    <name>ПоВертикали</name>
  </enumValues>
  <enumValues>
    <name>ПоГоризонтали</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Reports/ДвиженияДокумента/Forms/ДвиженияДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Функция возвращает непустые движения документа.
//
Функция ОпределитьНаличиеДвиженийПоРегистратору() 
	
	ТекстЗапроса = "";	
	ДвиженияДокумента = Отчет.Документ.Метаданные().Движения;
	
	Если ДвиженияДокумента.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Для Каждого Движение ИЗ ДвиженияДокумента Цикл
		
		ТекстЗапроса = ТекстЗапроса + "
		|" + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ ") + "
		|ВЫБРАТЬ ПЕРВЫЕ 1 ВЫРАЗИТЬ(""" + Движение.ПолноеИмя() 
		+  """ КАК Строка(200)) КАК Имя ИЗ " + Движение.ПолноеИмя() 
		+ " ГДЕ Регистратор = &Регистратор";
		
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	ЗАпрос.УстановитьПараметр("Регистратор", Отчет.Документ);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаЗапроса.Индексы.Добавить("Имя");
	
	Для Каждого СтрокаТаблицыДвижений Из ТаблицаЗапроса Цикл		
		СтрокаТаблицыДвижений.Имя = Врег(СокрЛП(СтрокаТаблицыДвижений.Имя));
	КонецЦикла;
	
	Возврат ТаблицаЗапроса;			
		
КонецФункции

&НаСервере
// Функция возвращает вид регистра.
//
Функция ОпределитьВидРегистра(МетаданныеРегистра)
	
	Если Метаданные.РегистрыНакопления.Индекс(МетаданныеРегистра) >= 0 Тогда
		Возврат "Накопления";
		
	ИначеЕсли Метаданные.РегистрыСведений.Индекс(МетаданныеРегистра) >= 0 Тогда
		Возврат "Сведений";	
		
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Индекс(МетаданныеРегистра) >= 0 Тогда
		Возврат "Бухгалтерии";
		
	Иначе
		Возврат "";
			
	КонецЕсли;
    	
КонецФункции

//+++ Дмгг
&НаСервере
// Функция возвращает вид регистра.
//
Функция ОпределитьВидРегистраСиноним(МетаданныеРегистра)
	
	Если Метаданные.РегистрыНакопления.Индекс(МетаданныеРегистра) >= 0 Тогда
		Возврат НСтр("ka='დაგროვებითი';ru='Накопления';en='accumulation'");
		
	ИначеЕсли Метаданные.РегистрыСведений.Индекс(МетаданныеРегистра) >= 0 Тогда
		Возврат НСтр("ka='ინფორმაციული';ru='Сведений';en='information'");	
		
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Индекс(МетаданныеРегистра) >= 0 Тогда
		Возврат НСтр("ka='ბუღალტრული';ru='Бухгалтерии';en='accounting'");
		
	Иначе
		Возврат "";
			
	КонецЕсли;
    	
КонецФункции
//--- Дмгг

&НаСервере
// Процедура формирует список полей для запроса.
//
Процедура СформироватьСписокПолей(МетаданныеРесурса, ТаблицаПолей, СписокПолей)
	
	Для Каждого Ресурс Из МетаданныеРесурса Цикл
		
		//Малышев 2025-01-03 - закоментировал                           
		Если (Ресурс.Имя = "Аналитика") Тогда // Прочие расчеты  
		     //Аналитику показываем
		ИначеЕсли (Ресурс.Тип.СодержитТип(Тип("СправочникСсылка.ХарактеристикиНоменклатуры")) И НЕ Константы.ФункциональнаяОпцияИспользоватьХарактеристики.Получить())
			ИЛИ (Ресурс.Тип.СодержитТип(Тип("СправочникСсылка.ПартииНоменклатуры")) И НЕ Константы.ФункциональнаяОпцияИспользоватьПартии.Получить()) 
			ИЛИ (Ресурс.Тип.СодержитТип(Тип("СправочникСсылка.Проекты")) И НЕ Константы.ФункциональнаяОпцияУчетПоПроектам.Получить())
			И (Ресурс.Имя <> "Аналитика") // Прочие расчеты  
			Тогда

			Продолжить;
			
		КонецЕсли;
		
		СписокПолей = СписокПолей + ", "+ Ресурс.Имя;
		ТаблицаПолей.Колонки.Добавить(Ресурс.Имя, , Ресурс.Синоним);
		
	КонецЦикла;
			 
			 
КонецПроцедуры

&НаСервере
// Процедура добавляет период в список полей для запроса.
//
Процедура ДобавитьПериодВСписокПолей(ТаблицаПолей, СписокПолей)
	
	СписокПолей = СписокПолей + ", Период";
	ТаблицаПолей.Колонки.Добавить("Период", , "Период");
	
КонецПроцедуры   

Процедура ДобавитьНомерСтрокидВСписокПолей(ТаблицаПолей, СписокПолей)
	
	СписокПолей = СписокПолей + ", НомерСтроки";
	ТаблицаПолей.Колонки.Добавить("НомерСтроки", , "№");
	
КонецПроцедуры   


&НаСервере
// Процедура выводит движения по регистрам сведений и накопления.
//
Процедура ОбработатьВыводДанныхПоМассиву(СписокПолей, ТаблицаРесурсов, ТаблицаИзмерений, ТаблицаРеквизитов, ТаблицаВидДвижений = Неопределено, Знач ИмяРегистра, СинонимРегистра)
	
	Если НЕ ЗначениеЗаполнено(СписокПолей) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ " + СписокПолей +"
		|{ВЫБРАТЬ " + СписокПолей +"}
		|ИЗ " + ИмяРегистра + " КАК Рег
		|ГДЕ Рег.Регистратор = &ДокументОтчета
		|	 И Рег.Активность";
		
	Запрос.УстановитьПараметр("ДокументОтчета", Отчет.Документ);	
        	
    ТаблицаРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультата Из ТаблицаРезультатЗапроса Цикл
		Если ТаблицаВидДвижений <> Неопределено Тогда
			НоваяСтрока = ТаблицаВидДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
		КонецЕсли;
		НоваяСтрока = ТаблицаРесурсов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
		НоваяСтрока = ТаблицаИзмерений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
	КонецЦикла; 
	
	Макет = Отчеты.ДвиженияДокумента.ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокОтчета");
		
	ОбластьЗаголовок.Параметры.СинонимРегистра = Строка(СинонимРегистра);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.НачатьГруппуСтрок();
	 
	КоличествоСтрокРезультата = ТаблицаРезультатЗапроса.Количество();	
		
	Если Отчет.СпособВыводаОтчета = Перечисления.СпособВыводаОтчета.ПоГоризонтали Тогда
	
		// Вывод в строку
		
		ОбластьЗаголовокЯчейки	 		= Макет.ПолучитьОбласть("ЗаголовокЯчейки");
		ОбластьЯчейка			 		= Макет.ПолучитьОбласть("Ячейка");
		ОбластьОтступ 					= Макет.ПолучитьОбласть("Отступ1");
		
		ТабличныйДокумент.Вывести(ОбластьОтступ);
		Если ТаблицаВидДвижений <> Неопределено Тогда
			ОбластьЗаголовокЯчейки.Параметры.ЗаголовокКолонки = "Вид движения";
	        ТабличныйДокумент.Присоединить(ОбластьЗаголовокЯчейки);
		КонецЕсли;
		Для каждого Колонка Из ТаблицаИзмерений.Колонки Цикл
			ОбластьЗаголовокЯчейки.Параметры.ЗаголовокКолонки = Колонка.Заголовок;
	        ТабличныйДокумент.Присоединить(ОбластьЗаголовокЯчейки);
		КонецЦикла; 
		Для каждого Колонка Из ТаблицаРесурсов.Колонки Цикл
			ОбластьЗаголовокЯчейки.Параметры.ЗаголовокКолонки = Колонка.Заголовок;
	        ТабличныйДокумент.Присоединить(ОбластьЗаголовокЯчейки);
		КонецЦикла;
	    Для каждого Колонка Из ТаблицаРеквизитов.Колонки Цикл
			ОбластьЗаголовокЯчейки.Параметры.ЗаголовокКолонки = Колонка.Заголовок;
	        ТабличныйДокумент.Присоединить(ОбластьЗаголовокЯчейки);
		КонецЦикла;
		
		Для НомерСтроки = 1 По КоличествоСтрокРезультата Цикл
			
			ТабличныйДокумент.Вывести(ОбластьОтступ);
			Если ТаблицаВидДвижений <> Неопределено Тогда
				ОбластьЯчейка.Параметры.Значение = ТаблицаВидДвижений[НомерСтроки-1].ВидДвижения;
				ТабличныйДокумент.Присоединить(ОбластьЯчейка);
				Если ТаблицаВидДвижений[НомерСтроки-1].ВидДвижения = ВидДвиженияНакопления.Расход Тогда
					Область = ТабличныйДокумент.Область("Ячейка");
					Область.ЦветТекста = Новый Цвет(255, 0, 0);
				Иначе
				    Область = ТабличныйДокумент.Область("Ячейка");
					Область.ЦветТекста = Новый Цвет(0, 0, 255);
				КонецЕсли;
			КонецЕсли;
			Для каждого Колонка Из ТаблицаИзмерений.Колонки Цикл
				Значение = ТаблицаИзмерений[НомерСтроки-1][Колонка.Имя]; 
				ОбластьЯчейка.Параметры.Значение = Значение;
		        Если ЗначениеЗаполнено(Значение) И ТипЗнч(Значение) <> Тип("Дата") И ТипЗнч(Значение) <> Тип("Число")
					И ТипЗнч(Значение) <> Тип("Булево") И ТипЗнч(Значение) <> Тип("Строка") Тогда
					ОбластьЯчейка.Параметры.ЗначениеРасшифровки = Значение;
				Иначе
					ОбластьЯчейка.Параметры.ЗначениеРасшифровки = Неопределено;				
				КонецЕсли; 
		        ТабличныйДокумент.Присоединить(ОбластьЯчейка);
			КонецЦикла; 
			Для каждого Колонка Из ТаблицаРесурсов.Колонки Цикл
				Значение = ТаблицаРесурсов[НомерСтроки-1][Колонка.Имя]; 
				ОбластьЯчейка.Параметры.Значение = Значение;
				Если ЗначениеЗаполнено(Значение) И ТипЗнч(Значение) <> Тип("Дата") И ТипЗнч(Значение) <> Тип("Число")
					И ТипЗнч(Значение) <> Тип("Булево") И ТипЗнч(Значение) <> Тип("Строка") Тогда
					ОбластьЯчейка.Параметры.ЗначениеРасшифровки = Значение;
				Иначе
					ОбластьЯчейка.Параметры.ЗначениеРасшифровки = Неопределено;
				КонецЕсли; 
		        ТабличныйДокумент.Присоединить(ОбластьЯчейка);
			КонецЦикла; 
			Для каждого Колонка Из ТаблицаРеквизитов.Колонки Цикл
				Значение = ТаблицаРеквизитов[НомерСтроки-1][Колонка.Имя]; 
				ОбластьЯчейка.Параметры.Значение = Значение;
		        Если ЗначениеЗаполнено(Значение) И ТипЗнч(Значение) <> Тип("Дата") И ТипЗнч(Значение) <> Тип("Число")
					И ТипЗнч(Значение) <> Тип("Булево") И ТипЗнч(Значение) <> Тип("Строка") Тогда
					ОбластьЯчейка.Параметры.ЗначениеРасшифровки = Значение;
				Иначе
					ОбластьЯчейка.Параметры.ЗначениеРасшифровки = Неопределено;				
				КонецЕсли; 
		        ТабличныйДокумент.Присоединить(ОбластьЯчейка);
			КонецЦикла; 
			
		КонецЦикла; 
		
	Иначе
	
		// Вывод таблицы
		
		Если ТаблицаВидДвижений <> Неопределено Тогда
			ОбластьШапки 					= Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьДеталиШапки 				= Макет.ПолучитьОбласть("ДеталиШапки");
			ОбластьДетали 					= Макет.ПолучитьОбласть("Детали");
			ОбластьШапкиВидДвижения 		= Макет.ПолучитьОбласть("ШапкаТаблицыВидДвижения");
			ОбластьДеталиШапкиВидДвижения 	= Макет.ПолучитьОбласть("ДеталиШапкиВидДвижения");
			ОбластьДеталиВидДвижения 		= Макет.ПолучитьОбласть("ДеталиВидДвижения");
			ОбластьОтступ 					= Макет.ПолучитьОбласть("Отступ");
		Иначе	
		    ОбластьШапки 					= Макет.ПолучитьОбласть("ШапкаТаблицы1");
			ОбластьДеталиШапки 				= Макет.ПолучитьОбласть("ДеталиШапки1");
			ОбластьДетали 					= Макет.ПолучитьОбласть("Детали1");
			ОбластьОтступ 					= Макет.ПолучитьОбласть("Отступ2");
		КонецЕсли;
		
			
		
		ТабличныйДокумент.Вывести(ОбластьОтступ);
		
		Если ТаблицаВидДвижений <> Неопределено Тогда
			ТабличныйДокумент.Присоединить(ОбластьШапкиВидДвижения);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьШапки);
	 	
		КоличествоСтрокШапки = Макс(ТаблицаРесурсов.Колонки.Количество(), ТаблицаИзмерений.Колонки.Количество(), ТаблицаРеквизитов.Колонки.Количество());
		ТолстаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2);
		ТонкаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		
		Для НомерСтроки = 1 По КоличествоСтрокШапки Цикл
			
			ОбластьДеталиШапки.Параметры.Ресурсы = "";
			ОбластьДеталиШапки.Параметры.Измерения = "";
			ОбластьДеталиШапки.Параметры.Реквизиты = "";
			
			Если ТаблицаРесурсов.Колонки.Количество() >= НомерСтроки Тогда
				ОбластьДеталиШапки.Параметры.Ресурсы = ТаблицаРесурсов.Колонки[НомерСтроки-1].Заголовок;
			КонецЕсли; 	
			Если ТаблицаИзмерений.Колонки.Количество() >= НомерСтроки Тогда
				ОбластьДеталиШапки.Параметры.Измерения = ТаблицаИзмерений.Колонки[НомерСтроки-1].Заголовок;
			КонецЕсли; 	
			Если ТаблицаРеквизитов.Колонки.Количество() >= НомерСтроки Тогда
				ОбластьДеталиШапки.Параметры.Реквизиты = ТаблицаРеквизитов.Колонки[НомерСтроки-1].Заголовок;
			КонецЕсли;
						
			ТабличныйДокумент.Вывести(ОбластьОтступ);
			Если ТаблицаВидДвижений <> Неопределено Тогда
				ТабличныйДокумент.Присоединить(ОбластьДеталиШапкиВидДвижения);	
			КонецЕсли;
			ТабличныйДокумент.Присоединить(ОбластьДеталиШапки);	
						
			Если НомерСтроки = КоличествоСтрокШапки Тогда
			    Если ТаблицаВидДвижений <> Неопределено Тогда
					Область = ТабличныйДокумент.Область("ДеталиШапкиВидДвижения");
					Область.Обвести(ТолстаяЛиния, , ТолстаяЛиния, ТолстаяЛиния);
					Область = ТабличныйДокумент.Область("ДеталиШапки");
					Область.Обвести(ТолстаяЛиния, , ТолстаяЛиния, ТолстаяЛиния);
				Иначе	
					Область = ТабличныйДокумент.Область("ДеталиШапки1");
					Область.Обвести(ТолстаяЛиния, , ТолстаяЛиния, ТолстаяЛиния);
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Для НомерСтроки = 1 По КоличествоСтрокРезультата Цикл
			
			ФлагВыведенВидДвижения = Ложь;
			
			Для НомерКолонки = 1 По КоличествоСтрокШапки Цикл
			
				ОбластьДетали.Параметры.Ресурсы = "";
				ОбластьДетали.Параметры.Измерения = "";
				ОбластьДетали.Параметры.Реквизиты = "";
				
				Если ТаблицаРесурсов.Колонки.Количество() >= НомерКолонки Тогда
					ИмяКолонки = ТаблицаРесурсов.Колонки[НомерКолонки-1].Имя;
					Значение = ТаблицаРесурсов[НомерСтроки-1][ИмяКолонки]; 
					ОбластьДетали.Параметры.Ресурсы = Значение;
					Если ЗначениеЗаполнено(Значение) И ТипЗнч(Значение) <> Тип("Дата") И ТипЗнч(Значение) <> Тип("Число")
						И ТипЗнч(Значение) <> Тип("Булево") И ТипЗнч(Значение) <> Тип("Строка") Тогда
						ОбластьДетали.Параметры.РесурсыРасшифровка = Значение;
					Иначе
						ОбластьДетали.Параметры.РесурсыРасшифровка = Неопределено;
					КонецЕсли;
				КонецЕсли; 	
				Если ТаблицаИзмерений.Колонки.Количество() >= НомерКолонки Тогда
					ИмяКолонки = ТаблицаИзмерений.Колонки[НомерКолонки-1].Имя;
					Значение = ТаблицаИзмерений[НомерСтроки-1][ИмяКолонки]; 
					ОбластьДетали.Параметры.Измерения = Значение;
					Если ЗначениеЗаполнено(Значение) И ТипЗнч(Значение) <> Тип("Дата") И ТипЗнч(Значение) <> Тип("Число")
						И ТипЗнч(Значение) <> Тип("Булево") И ТипЗнч(Значение) <> Тип("Строка") Тогда
						ОбластьДетали.Параметры.ИзмеренияРасшифровка = Значение;
					Иначе
						ОбластьДетали.Параметры.ИзмеренияРасшифровка = Неопределено;
					КонецЕсли;
				КонецЕсли; 	
				Если ТаблицаРеквизитов.Колонки.Количество() >= НомерКолонки Тогда
					ИмяКолонки = ТаблицаРеквизитов.Колонки[НомерКолонки-1].Имя;
					Значение = ТаблицаРеквизитов[НомерСтроки-1][ИмяКолонки]; 
					ОбластьДетали.Параметры.Реквизиты = Значение;
					Если ЗначениеЗаполнено(Значение) И ТипЗнч(Значение) <> Тип("Дата") И ТипЗнч(Значение) <> Тип("Число")
						И ТипЗнч(Значение) <> Тип("Булево") И ТипЗнч(Значение) <> Тип("Строка") Тогда
						ОбластьДетали.Параметры.РеквизитыРасшифровка = Значение;
					Иначе
						ОбластьДетали.Параметры.РеквизитыРасшифровка = Неопределено;
					КонецЕсли;
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьОтступ);
				
				Если ТаблицаВидДвижений <> Неопределено Тогда

					Если ФлагВыведенВидДвижения Тогда
						ЗначениеПараметра = "";
					Иначе
						ЗначениеПараметра = ТаблицаВидДвижений[НомерСтроки-1]["ВидДвижения"];
						ФлагВыведенВидДвижения = Истина;
					КонецЕсли;

					ОбластьДеталиВидДвижения.Параметры.ВидДвижения = ЗначениеПараметра;
					ТабличныйДокумент.Присоединить(ОбластьДеталиВидДвижения);

                    Если ЗначениеПараметра = ВидДвиженияНакопления.Расход Тогда
						Область = ТабличныйДокумент.Область("ДеталиВидДвижения");
						Область.ЦветТекста = Новый Цвет(255, 0, 0);
					ИначеЕсли ЗначениеПараметра = ВидДвиженияНакопления.Приход Тогда
					    Область = ТабличныйДокумент.Область("ДеталиВидДвижения");
						Область.ЦветТекста = Новый Цвет(0, 0, 255);
					КонецЕсли;
				КонецЕсли;
				
				ТабличныйДокумент.Присоединить(ОбластьДетали);
				
                Если НомерКолонки = КоличествоСтрокШапки Тогда
				    Если ТаблицаВидДвижений <> Неопределено Тогда
						Область = ТабличныйДокумент.Область("ДеталиВидДвижения");
						Область.Обвести(ТонкаяЛиния, , ТонкаяЛиния, ТонкаяЛиния);
                        Область = ТабличныйДокумент.Область("Детали");
						Область.Обвести(ТонкаяЛиния, , ТонкаяЛиния, ТонкаяЛиния);
                    Иначе
                        Область = ТабличныйДокумент.Область("Детали1");
						Область.Обвести(ТонкаяЛиния, , ТонкаяЛиния, ТонкаяЛиния);
					КонецЕсли;
					
				КонецЕсли;

			КонецЦикла;
			
		КонецЦикла; 
		
	КонецЕсли;	
		
	ТабличныйДокумент.ЗакончитьГруппуСтрок();
			    	
КонецПроцедуры

&НаСервере
// Процедура выводит движения по регистру бухгалтерии.
//
Процедура ВывестиЖурналПроводок()
	
	Если ИспользованиеТолькоРеглПланаСчетов Тогда 
		Возврат;
	КонецЕсли;
	
	Макет 				= Отчеты.ДвиженияДокумента.ПолучитьМакет("Макет");
	МакетЖурналПроводок = Отчеты.ДвиженияДокумента.ПолучитьМакет("МакетЖурналПроводок");
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьШапка 		= МакетЖурналПроводок.ПолучитьОбласть("Шапка");
	ОбластьДетали 		= МакетЖурналПроводок.ПолучитьОбласть("Детали");
		
	ОбластьЗаголовок.Параметры.СинонимРегистра = НСТР("en='Accounting register ""Management""';ka='ბუღალტრული რეგისტრი ""მმართველობითი""';ru='Регистр бухгалтерии ""Управленческий""'");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.НачатьГруппуСтрок();
	
    ТабличныйДокумент.Вывести(ОбластьШапка);	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Управленческий.Период КАК Период,
	|	Управленческий.Регистратор КАК Регистратор,
	|	Управленческий.НомерСтроки КАК НомерСтроки,
	|	Управленческий.Активность КАК Активность,
	|	Управленческий.СчетДт КАК СчетДт,
	|	Управленческий.СчетКт КАК СчетКт,
	|	Управленческий.Организация КАК Организация,
	|	Управленческий.СценарийПланирования КАК СценарийПланирования,
	|	Управленческий.ВалютаДт КАК ВалютаДт,
	|	Управленческий.ВалютаКт КАК ВалютаКт,
	|	Управленческий.Сумма КАК Сумма,
	|	Управленческий.СуммаВалДт КАК СуммаВалДт,
	|	Управленческий.СуммаВалКт КАК СуммаВалКт,
	|	Управленческий.Содержание КАК Содержание
	|ИЗ
	|	РегистрБухгалтерии.Управленческий КАК Управленческий
	|ГДЕ
	|	Управленческий.Регистратор = &ДокументОтчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
    
	Запрос.УстановитьПараметр("ДокументОтчета", 	Отчет.Документ);	
			
	ТаблицаРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаРезультата Из ТаблицаРезультатЗапроса Цикл
			
        ЗаполнитьЗначенияСвойств(ОбластьДетали.Параметры, СтрокаРезультата);
        ТабличныйДокумент.Вывести(ОбластьДетали);

	КонецЦикла; 
	
	ТабличныйДокумент.ЗакончитьГруппуСтрок();
			    	
КонецПроцедуры

&НаСервере
// Процедура выводит движения по регистру бухгалтерии хозрасчетный.
//
Процедура ВывестиЖурналПроводокРегл()
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйДвиженияССубконто.Период КАК Период,
	|	ХозрасчетныйДвиженияССубконто.Регистратор КАК Регистратор,
	|	ХозрасчетныйДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	|	ХозрасчетныйДвиженияССубконто.Активность КАК Активность,
	|	ХозрасчетныйДвиженияССубконто.СчетДт КАК СчетДт,
	|	ХозрасчетныйДвиженияССубконто.СчетКт КАК СчетКт,
	|	ХозрасчетныйДвиженияССубконто.Организация КАК Организация,
	|	ХозрасчетныйДвиженияССубконто.ВалютаДт КАК ВалютаДт,
	|	ХозрасчетныйДвиженияССубконто.ВалютаКт КАК ВалютаКт,
	|	ХозрасчетныйДвиженияССубконто.Сумма КАК Сумма,
	|	ХозрасчетныйДвиженияССубконто.Содержание КАК Содержание,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт1,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт2,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт3,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт1,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт2,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт3,
	|	ХозрасчетныйДвиженияССубконто.ВалютнаяСуммаДт,
	|	ХозрасчетныйДвиженияССубконто.ВалютнаяСуммаКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(, , Регистратор = &ДокументОтчета, , ) КАК ХозрасчетныйДвиженияССубконто
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
    
	Запрос.УстановитьПараметр("ДокументОтчета", 	Отчет.Документ);
	ТаблицаРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	// Олег Литвиненко 25.07.23 --->
	// ONESOFT-2371	
	Если ТаблицаРезультатЗапроса.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	// Олег Литвиненко <---
	
	Макет 				= Отчеты.ДвиженияДокумента.ПолучитьМакет("Макет");
	МакетЖурналПроводок = Отчеты.ДвиженияДокумента.ПолучитьМакет("МакетЖурналПроводокРегл");
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьШапка 		= МакетЖурналПроводок.ПолучитьОбласть("Шапка");
	ОбластьДетали 		= МакетЖурналПроводок.ПолучитьОбласть("Детали");
		
	ОбластьЗаголовок.Параметры.СинонимРегистра = НСтр("ka='ბუღალტრული რეგისტრი ""გატარებების ჟურნალი (ბუღალტრული და საგადასახადო აღრიცხვა)""';ru='Регистр бухгалтерии ""Хозрасчетный""';en='Accounting register ""Self-supporting""'");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.НачатьГруппуСтрок();
	
    ТабличныйДокумент.Вывести(ОбластьШапка);
			
	Для каждого СтрокаРезультата Из ТаблицаРезультатЗапроса Цикл
			
        ЗаполнитьЗначенияСвойств(ОбластьДетали.Параметры, СтрокаРезультата);
        ТабличныйДокумент.Вывести(ОбластьДетали);

	КонецЦикла; 
	
	ТабличныйДокумент.ЗакончитьГруппуСтрок();
			    	
КонецПроцедуры

// Олег Литвиненко 25.07.23 --->
&НаСервере
// Процедура выводит движения по регистру бухгалтерии хозрасчетный (План).
//
Процедура ВывестиЖурналПроводокПлан()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйДвиженияССубконто.Период КАК Период,
	|	ХозрасчетныйДвиженияССубконто.Регистратор КАК Регистратор,
	|	ХозрасчетныйДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	|	ХозрасчетныйДвиженияССубконто.Активность КАК Активность,
	|	ХозрасчетныйДвиженияССубконто.СценарийПланирования КАК СценарийПланирования,
	|	ХозрасчетныйДвиженияССубконто.СчетДт КАК СчетДт,
	|	ХозрасчетныйДвиженияССубконто.СчетКт КАК СчетКт,
	|	ХозрасчетныйДвиженияССубконто.Организация КАК Организация,
	|	ХозрасчетныйДвиженияССубконто.ВалютаДт КАК ВалютаДт,
	|	ХозрасчетныйДвиженияССубконто.ВалютаКт КАК ВалютаКт,
	|	ХозрасчетныйДвиженияССубконто.Сумма КАК Сумма,
	|	ХозрасчетныйДвиженияССубконто.Содержание КАК Содержание,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	|	ХозрасчетныйДвиженияССубконто.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
	|	ХозрасчетныйДвиженияССубконто.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт
	|ИЗ
	|	РегистрБухгалтерии.ХозрасчетныйПлан.ДвиженияССубконто(, , Регистратор = &ДокументОтчета, , ) КАК ХозрасчетныйДвиженияССубконто
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
    
	Запрос.УстановитьПараметр("ДокументОтчета", 	Отчет.Документ);	
			
	ТаблицаРезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Если ТаблицаРезультатЗапроса.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Макет 				= Отчеты.ДвиженияДокумента.ПолучитьМакет("Макет");
	МакетЖурналПроводок = Отчеты.ДвиженияДокумента.ПолучитьМакет("МакетЖурналПроводокПлан");
	
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьШапка 		= МакетЖурналПроводок.ПолучитьОбласть("Шапка");
	ОбластьДетали 		= МакетЖурналПроводок.ПолучитьОбласть("Детали");
		
	ОбластьЗаголовок.Параметры.СинонимРегистра = НСтр("ka='ბუღალტრული რეგისტრი ""გატარებების ჟურნალი (ბუღალტრული და საგადასახადო აღრიცხვა)""';ru='Регистр бухгалтерии ""Хозрасчетный (план)""';en='Accounting register ""Self-supporting (plan)""'");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.НачатьГруппуСтрок();
	
    ТабличныйДокумент.Вывести(ОбластьШапка);	
	
	Для каждого СтрокаРезультата Из ТаблицаРезультатЗапроса Цикл
			
        ЗаполнитьЗначенияСвойств(ОбластьДетали.Параметры, СтрокаРезультата);
        ТабличныйДокумент.Вывести(ОбластьДетали);

	КонецЦикла; 
	
	ТабличныйДокумент.ЗакончитьГруппуСтрок();
			    	
КонецПроцедуры // Олег Литвиненко <---

&НаСервере                                              
// Процедура формирует отчет на сервере.
//
Процедура СформироватьОтчет()
	
    Если НЕ ЗначениеЗаполнено(Отчет.Документ) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='Не выбран документ!';ru='Не выбран документ!';en='Do not select a document!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент.Очистить();
	Макет = Отчеты.ДвиженияДокумента.ПолучитьМакет("Макет");
	ДвиженияДокумента = Отчет.Документ.Метаданные().Движения;
		
	// Вывод заголовка
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ГлавныйЗаголовок");
	ОбластьЗаголовок.Параметры.Документ = Строка(Отчет.Документ);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);

    // Поиск регистров, по которым есть движения
	ТаблицаДвижений = ОпределитьНаличиеДвиженийПоРегистратору();
	
    ВыводитьЖурналПроводок = Ложь;
	ВыводитьЖурналПроводокРегл = Ложь;
			
	// Перебор движений
	Для Каждого СвойстваОбъекта Из ДвиженияДокумента Цикл
		
		// Проверка, есть ли движения по регистру
		СтрокаВТаблицеРегистров = ТаблицаДвижений.Найти(Врег(СвойстваОбъекта.ПолноеИмя()), "Имя");
		
		Если СтрокаВТаблицеРегистров = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КодЯзыка = ?(Строка(НСтр("ka='1';ru='2'")) = "1", 1, 2);
		ВидРегистра = ОпределитьВидРегистра(СвойстваОбъекта);
		ВидРегистраСиноним = ОпределитьВидРегистраСиноним(СвойстваОбъекта);
 		ИмяРегистра = "Регистр" + ВидРегистра + "." + СвойстваОбъекта.Имя;
		
		Если КодЯзыка = 1 Тогда 
			СинонимРегистра = НРег(ВидРегистраСиноним) + " " + НСтр("ru = 'Регистр '; ka = 'რეგისტრი '") + " """ + СвойстваОбъекта.Синоним + """";
		ИначеЕсли КодЯзыка = 2 Тогда
			СинонимРегистра = НСтр("ru = 'Регистр '; ka = 'რეგისტრი '") + НРег(ВидРегистраСиноним) + " """ + СвойстваОбъекта.Синоним + """";
		Иначе
			СинонимРегистра = НСтр("ru = 'Регистр '; ka = 'რეგისტრი '") + НРег(ВидРегистраСиноним) + " """ + СвойстваОбъекта.Синоним + """";
		КонецЕсли;
		
		Если ВидРегистра = "Сведений" ИЛИ ВидРегистра = "Накопления" Тогда
			
			СписокПолей = "";
			ТаблицаРесурсов = Новый ТаблицаЗначений;                                            
			ТаблицаИзмерений = Новый ТаблицаЗначений;
			ТаблицаРеквизитов = Новый ТаблицаЗначений;
			
			Если ВидРегистра = "Сведений" И СвойстваОбъекта.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			Иначе
				ДобавитьПериодВСписокПолей(ТаблицаИзмерений, СписокПолей);
			КонецЕсли;
			ДобавитьНомерСтрокидВСписокПолей(ТаблицаИзмерений, СписокПолей); //Малышев 2024-07-14
			СформироватьСписокПолей(СвойстваОбъекта.Ресурсы, ТаблицаРесурсов, СписокПолей);
            СформироватьСписокПолей(СвойстваОбъекта.Измерения, ТаблицаИзмерений, СписокПолей);
			СформироватьСписокПолей(СвойстваОбъекта.Реквизиты, ТаблицаРеквизитов, СписокПолей);
            СписокПолей = Прав(СписокПолей, СтрДлина(СписокПолей)-2);
			
			Если (ВидРегистра = "Накопления") И (СвойстваОбъекта.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки) Тогда
				СписокПолей = СписокПолей + ", ВидДвижения";
				ТаблицаВидДвижений = Новый ТаблицаЗначений;
			    ТаблицаВидДвижений.Колонки.Добавить("ВидДвижения", , "Вид движения");
            	ОбработатьВыводДанныхПоМассиву(СписокПолей, ТаблицаРесурсов, ТаблицаИзмерений, ТаблицаРеквизитов, ТаблицаВидДвижений, ИмяРегистра, СинонимРегистра);
			Иначе
                ОбработатьВыводДанныхПоМассиву(СписокПолей, ТаблицаРесурсов, ТаблицаИзмерений, ТаблицаРеквизитов, , ИмяРегистра, СинонимРегистра);
			КонецЕсли; 
            
		ИначеЕсли ВидРегистра = "Бухгалтерии" Тогда
         	
            ВыводитьЖурналПроводок = Истина;

		КонецЕсли;

	КонецЦикла;	
	
	Если ВыводитьЖурналПроводок Тогда
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПоказатьРеквизитыУправленческогоУчета") Тогда
		 	ВывестиЖурналПроводок();
		КонецЕсли;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПоказыватьБухгалтерскиеПроводки") Тогда
			ВывестиЖурналПроводокРегл();
		КонецЕсли;
		// Олег Литвиненко 25.07.23 --->
		// ONESOFT-2371
		ВывестиЖурналПроводокПлан();
		// Олег Литвиненко <---
	КонецЕсли;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИспользованиеТолькоРеглПланаСчетов = Ложь; 
	Если Параметры.Свойство("Документ") Тогда
		Отчет.Документ = Параметры.Документ;
		
		ИспользованиеТолькоРеглПланаСчетов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьРегламентированныйПланСчетов")
												И УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ДатаНачалаИспользованияРеглПланаСчетов") < Параметры.Документ.Дата;
		
	КонецЕсли; 
	
	Отчет.СпособВыводаОтчета = Перечисления.СпособВыводаОтчета.ПоГоризонтали;
	СпособВыводаОтчета = Отчет.СпособВыводаОтчета;
	ОтчетСформирован = Ложь;
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ПриСохраненииДанныхВНастройкахНаСервере формы.
//
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Вставить("СпособВыводаОтчета", СпособВыводаОтчета);
	
КонецПроцедуры

// Процедура - обработчик события ПриЗагрузкеДанныхИзНастроекНаСервере формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Значение = Настройки.Получить("СпособВыводаОтчета");
	Если Значение <> Неопределено Тогда
		Отчет.СпособВыводаОтчета = Значение;
		СпособВыводаОтчета = Значение;
	КонецЕсли;
		
	ОтчетСформирован = Истина;
	СформироватьОтчет();
	
КонецПроцедуры

// Процедура - обработчик события ПриОткрытии формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ОтчетСформирован Тогда
		// Отчёт будет не сформирован только один раз при первом открытии этой формы.
		// Т.к. обработчик ПриЗагрузкеДанныхИзНастроекНаСервере не вызывается.
		СформироватьОтчет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик нажатия на кнопку "Сформировать".
//
Процедура СформироватьВыполнить()
	
	СформироватьОтчет();
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события ПриИзменении элемента СпособВыводаОтчета формы.
//
&НаКлиенте
Процедура СпособВыводаОтчетаПриИзменении(Элемент)
	
	СпособВыводаОтчета = Отчет.СпособВыводаОтчета;
	СформироватьВыполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	ПодключитьОбработчикОжидания("РассчитатьСуммуЯчеек", 0.2, Истина);

КонецПроцедуры

// Вычисляет сумму выделенных ячеек и возвращает ее представление.
//
// Параметры:
//   ТабличныйДокумент - ТабличныйДокумент - Таблица, для которой вычисляет сумма ячеек.
//   ВыделенныеОбласти
//       - Неопределено - При вызове с клиента этот параметр будет определен автоматически.
//       - Массив - При вызове с сервера в этот параметр следует передавать области,
//           предварительно вычисленные на клиенте
//           при помощи функции ОтчетыКлиент.ВыделенныеОбласти(ТабличныйДокумент).
//
// Возвращаемое значение: 
//   Строка - Представление суммы выделенных ячеек.
//
// См. также:
//   ОтчетыКлиент.ВыделенныеОбласти().
//
&НаКлиентеНаСервереБезКонтекста
Функция СуммаЯчеек(ТабличныйДокумент, ВыделенныеОбласти)
	
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
	
	Если ВыделенныеОбласти = Неопределено Тогда
		#Если Клиент Тогда
			ВыделенныеОбласти = ТабличныйДокумент.ВыделенныеОбласти;
		#Иначе
			Возврат НСтр("ru = 'Не указано значение параметра ""ВыделенныеОбласти"".'; ka = 'პარამეტრ ""გამოყოფილიარეალები""-ს მნიშვნელობა არ არის მითითებული.'; en = 'Unknown value ""SelectedAreas"".'");
		#КонецЕсли
	КонецЕсли;
	
	#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
		КоличествоВыделенныхОбластей = ВыделенныеОбласти.Количество();
		Если КоличествоВыделенныхОбластей = 0 Тогда
			Возврат ""; // Нет ни одного числа.
		ИначеЕсли КоличествоВыделенныхОбластей >= 100 Тогда
			Возврат "<"; // Нужен вызов сервера.
		КонецЕсли;
		КоличествоВыделенныхЯчеек = 0;
	#КонецЕсли
	
	Сумма = Неопределено;
	ПроверенныеЯчейки = Новый Соответствие;
	
	Для Каждого ВыделеннаяОбласть Из ВыделенныеОбласти Цикл
		#Если Клиент Тогда
			Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
				Продолжить;
			КонецЕсли;
		#КонецЕсли
		
		ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Верх;
		ВыделеннаяОбластьНиз = ВыделеннаяОбласть.Низ;
		ВыделеннаяОбластьЛево = ВыделеннаяОбласть.Лево;
		ВыделеннаяОбластьПраво = ВыделеннаяОбласть.Право;
		
		Если ВыделеннаяОбластьВерх = 0 Тогда
			ВыделеннаяОбластьВерх = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьНиз = 0 Тогда
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбластьЛево = 0 Тогда
			ВыделеннаяОбластьЛево = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьПраво = 0 Тогда
			ВыделеннаяОбластьПраво = ТабличныйДокумент.ШиринаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда
			ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Низ;
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		ВыделеннаяОбластьВысота = ВыделеннаяОбластьНиз   - ВыделеннаяОбластьВерх;
		ВыделеннаяОбластьШирина = ВыделеннаяОбластьПраво - ВыделеннаяОбластьЛево;
		
		#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
			КоличествоВыделенныхЯчеек = КоличествоВыделенныхЯчеек + ВыделеннаяОбластьШирина * ВыделеннаяОбластьВысота;
			Если КоличествоВыделенныхЯчеек >= 1000 Тогда
				Возврат "<"; // Нужен вызов сервера.
			КонецЕсли;
		#КонецЕсли
		
		Для НомерКолонки = ВыделеннаяОбластьЛево По ВыделеннаяОбластьПраво Цикл
			Для НомерСтроки = ВыделеннаяОбластьВерх По ВыделеннаяОбластьНиз Цикл
				Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
				Если ПроверенныеЯчейки.Получить(Ячейка.Имя) = Неопределено Тогда
					ПроверенныеЯчейки.Вставить(Ячейка.Имя, Истина);
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если Ячейка.Видимость = Истина Тогда
					Если Ячейка.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Колонки
						И Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
						Число = Ячейка.Значение;
					ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
						Число = ОписаниеТиповЧисло.ПривестиЗначение(Ячейка.Текст);
					Иначе
						Продолжить;
					КонецЕсли;
					Если ТипЗнч(Число) = Тип("Число") Тогда
						Если Сумма = Неопределено Тогда
							Сумма = Число;
						Иначе
							Сумма = Сумма + Число;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если Сумма = Неопределено Тогда
		Возврат ""; // Нет ни одного числа.
	КонецЕсли;
	
	Возврат Формат(Сумма, "ЧН=0");
	
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуЯчеек()
	
	Если КоличествоВыделенныхЯчеек()>1 Тогда
		СуммаВыделенныхЯчеек = СуммаЯчеек(ТабличныйДокумент, Неопределено);
		Если СуммаВыделенныхЯчеек="<" Тогда
			СуммаВыделенныхЯчеек = РассчитатьСуммуЯчеекСервер(ТабличныйДокумент, ВыделенныеОбласти());
		КонецЕсли; 
		Если ПустаяСтрока(СуммаВыделенныхЯчеек) Тогда
			СуммаДокумента = "";
		Иначе
			СуммаДокумента = "Σ "+СуммаВыделенныхЯчеек;
		КонецЕсли; 
	Иначе
		СуммаДокумента = "";
	КонецЕсли;
	
	Если ПустаяСтрока(СуммаДокумента) Тогда
		СуммаДокумента = Элементы.СуммаДокумента.Подсказка;
	КонецЕсли; 
	Элементы.СуммаДокумента.Подсказка = "" + СуммаДокумента;
	
КонецПроцедуры

&НаКлиенте
Функция ВыделенныеОбласти()
	
	ВыделенныеОбласти = Новый Массив;
	Для каждого Область Из ТабличныйДокумент.ВыделенныеОбласти Цикл
		Если НЕ ТипЗнч(Область)=Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;
		СтруктураПоложения = Новый Структура;
		СтруктураПоложения.Вставить("Верх", Область.Верх);
		СтруктураПоложения.Вставить("Низ", Область.Низ);
		СтруктураПоложения.Вставить("Лево", Область.Лево);
		СтруктураПоложения.Вставить("Право", Область.Право);
		СтруктураПоложения.Вставить("ТипОбласти", Область.ТипОбласти);
		ВыделенныеОбласти.Добавить(СтруктураПоложения);
	КонецЦикла;
	Возврат ВыделенныеОбласти;
	
КонецФункции

&НаСервереБезКонтекста
Функция РассчитатьСуммуЯчеекСервер(Знач ТабличныйДокумент, ВыделенныеОбласти)
	
	Возврат СуммаЯчеек(ТабличныйДокумент, ВыделенныеОбласти);
	
КонецФункции 

&НаКлиенте
Функция КоличествоВыделенныхЯчеек()
	
	Результат = 0;
	Для каждого Область Из ТабличныйДокумент.ВыделенныеОбласти Цикл
		Если НЕ ТипЗнч(Область)=Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли; 
		Результат = Результат+(Область.Право-Область.Лево+1)*(Область.Низ-Область.Верх+1);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции


#КонецОбласти
